Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལ་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་གང་ཞེ་ན། གང་ལས་གནག་ལ་རྣམ་པར་སྨིན་པ་གནག་པ་དེ་ལྟ་བུ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། གང་ལས་དཀར་ལ་རྣམ་པར་སྨིན་པ་དཀར་བ་དེ་ལྟ་བུའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དང་། གང་ལས་དཀར་གནག་ལ་རྣམ་པར་སྨིན་པ་དཀར་གནག་ཏུ་འགྱུར་བ་དེ་ལྟ་བུའི་ལས་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། གང་ལས་དཀར་གནག་མ་ཡིན་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་བ་ལས་ཟད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལས་མངོན་པར་འདུ་བྱེད་པ་སྟེ། དེ་ལས་བདག་གིར་བྱ་བ། ལས་ལ་རྟོན་པ། ཡང་དག་པའི་ལས་ལ་བརྩོན་པས་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཞེས་བྱའོ། །
en: “What is right action? It is to not engage in negative actions that have negative effects. It is to engage in positive actions that have positive effects. It is to not engage in actions that are a mixture of both positive and negative and that have both positive and negative effects. It is to engage in actions that are a mixture of both positive and negative but have no effects, and that lead to the cessation of action. To focus on one’s own tasks, to trust in action, and to act in appropriate ways is what is known as right action.

source: དེ་ལ་ཡང་དག་པའི་འཚོ་བ་གང་ཞེ་ན། གང་འཕགས་པའི་རིགས་དང་། སྦྱངས་པའི་ཡོན་ཏན་མི་གཏོང་བ་དང་། ཁ་གསག་མེད་པ་དང་། ཚུལ་འཆོས་པ་མེད་པ་དང་། ཐོབ་ཀྱིས་འཇལ་བ་མེད་པ་དང་། དགང་སླ་བ་དང་། གསོ་སླ་བ་དང་། ཆོ་ག་མི་ལྷོད་པ་དང་། གཞན་གྱི་རྙེད་པ་ལ་ཕྲག་དོག་མེད་པ་དང་། བདག་གི་རྙེད་པས་ཆོག་ཤེས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། འཕགས་པས་གནང་བའི་འཚོ་བ་སྟེ། དེ་ནི་ཡང་དག་པའི་འཚོ་བའོ། །
en: “What is right livelihood? It is to not abandon the noble lineage, the good qualities of a life of purity. It is to not engage in flattery, hypocrisy, or extortion. It is to be content and easily satisfied. It is to not be lax about one’s commitments. It is to not be envious of others’ possessions and to be content with the possessions one has. It is to be irreproachable and live according to what has been sanctioned by the noble ones. This is what is known as right livelihood.

source: དེ་ལ་ཡང་དག་པའི་རྩོལ་བ་གང་ཞེ་ན། རྩོལ་བ་གང་ལོག་པར་སྤྱོད་པར་བཤད་པ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པ་བག་ལ་ཉལ་བའི་རྩོལ་བ་དེ་མི་འདོད་ཀྱི། རྩོལ་བ་གང་འཕགས་པའི་ལམ་དང་བདེན་པ་ལ་འཇུག་པ། མྱ་ངན་ལས་འདས་པ་འགྲོ་བའི་ལམ་དུ་འཇོག་པར་བྱེད་པའི་རྩོལ་བ་དེ་ནི་རྗེས་སུ་འགྲོ་བ་སྟེ། དེ་ནི་ཡང་དག་པའི་རྩོལ་བ་ཞེས་བྱའོ། །
en: “What is right effort? One should not make the kind of effort that accepts misguided forms of conduct and that tends toward desire, anger, and confusion. One should make the kind of effort that leads to progress along the noble path and access to truth and that helps one to reach nirvāṇa. This is what is known as right effort.

source: དེ་ལ་ཡང་དག་པའི་དྲན་པ་གང་ཞེ་ན། དྲན་པ་གང་ཤིན་ཏུ་ཉེ་བར་གཞོག་པ་དང་། ཐ་མལ་པ་མ་ཡིན་པ་དང་། དྲང་བ་དང་། གྱ་གྱུ་མེད་པ་དང་། འཁོར་བའི་ཉེས་པ་དང་། སྐྱོན་ལ་ལྟ་བ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་དུ་འདྲེན་པའི་དྲན་པ་དང་། དྲན་པར་བྱེད་པ་དང་། འཕགས་པའི་ལམ་མི་བརྗེད་པ་སྟེ། དེ་ནི་ཡང་དག་པའི་དྲན་པ་ཞེས་བྱའོ། །
en: “What is right mindfulness? It is a mindfulness that is skillfully performed, not ordinary; straight, not askew. It is a mindfulness that sees the deficiencies and the faults of cyclic existence and that is a guide on the path to nirvāṇa. It is a mindfulness that recollects, that remembers, and that does not forget the noble path. This is what is known as right mindfulness.

source: དེ་ལ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཡང་དག་པ་ཉིད་དུ་མཉམ་པ་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་སྟེ། ཏིང་ངེ་འཛིན་དེ་ལ་རབ་ཏུ་གནས་ན་ཡང་དག་པ་ཉིད་དུ་འཇུག་སྟེ། གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ན་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་ཡང་དག་པ་ཉིད་དུ་འཇུག་པ་དེ་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། ། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ལམ་མི་ཟད་པ་འདི། བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་རྟོགས་ནས་ འཆད་པ་དང་། སྟོན་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: “What is right concentration? It is to be perfectly even, the same as all phenomena. When one dwells in this state of concentration, one is engaging with perfection, and a bodhisatva who dwells in this state of concentration engages with perfection in order to liberate all sentient beings. This is what is known as right concentration. This imperishable path is the path that has been taken by the lords, the buddhas, of the past, the future, and the present, and when the bodhisatva has realized it, he communicates it, explains it, and elucidates it. This is what is known as right concentration.

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཡན་ལག་བརྒྱད་པ་ཞེས་བྱ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ལ་མཁས་པའོ། །
en: “These are what are known as the eight aspects of the path of the bodhisatva. This is the bodhisatva’s skilled approach to path.

source: གཞན་ཡང་ལམ་ལ་མཁས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཡན་ལག་གཉིས་པ་སྟེ། ཡན་ལག་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཞི་གནས་དང་ལྷག་མཐོང་སྟེ། དེ་ནི་ལམ་ཡན་ལག་གཉིས་པ་ཞེས་བྱའོ། །
en: “Furthermore, when it comes to skill in the path, the path of the bodhisatvas has two parts. What are these two parts? They are calm abiding meditation and insight meditation. This is what is known as the twofold path.

source: དེ་ལ་ཞི་གནས་གང་ཞེ་ན། གང་སེམས་ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བ་དང་། མི་གཡེང་བ་དང་། དབང་པོ་རྣམས་བསྡམས་པ་དང་། མི་རྒོད་པ་དང་། མ་ཁེངས་པ་དང་། མི་འཕྱར་བ་དང་། མུ་ཅོར་མི་སྨྲ་བ་དང་། དེས་པ་དང་། སྦས་པ་དང་། གཡོ་མེད་པ་དང་། ཡིད་དུ་འོང་བ་དང་། གཅིག་པུར་དགའ་བ་དང་། འདུ་འཛི་སེལ་བ་དང་། དབེན་པར་དགའ་བ་དང་། ལུས་དབེན་པ་དང་། སེམས་མ་འཁྲུལ་པ་དང་། དགོན་པའི་སྒོ་ཡིད་ལ་བྱེད་པ་དང་། ཆོག་ཤེས་པ་དང་། འདོད་པ་ཉུང་བ་དང་། འཚོ་བ་ཡོངས་སུ་དག་པ་དང་། ཆོ་ག་ཕུན་སུམ་ཚོགས་པ་དང་། སྤྱོད་ལམ་སྦས་པ་དང་། དུས་ཤེས་པ་དང་། ཚོད་ཤེས་པ་དང་། དྲོད་ཤེས་པ་དང་། དགང་སླ་བ་དང་། གསོ་སླ་བ་དང་། སོ་སོར་རྟོག་པ་དང་། མི་མཐོ་མི་དམའ་བ་དང་། ཚིག་ངན་པ་སྨྲས་པ་བཟོད་པ་དང་། རྣལ་འབྱོར་གྱི་སྒོར་སེམས་བསྐྱེད་པ་དང་། ནང་དུ་ཡང་དག་འཇོག་ལ་མངོན་པར་དགའ་བ་དང་། བསམ་གཏན་གྱི་ཡན་ལག་ཡིད་ལ་བྱེད་པ་དང་། བྱམས་པ་བསྐྱེད་པ་དང་། སྙིང་རྗེ་མངོན་པར་སྒྲུབ་པ་དང་། དགའ་བ་ལ་གནས་པ་དང་། བཏང་སྙོམས་སྒོམ་པ་དང་། བསམ་གཏན་དང་པོ་ནས། བརྒྱད་ཀྱི་བར་དུ་མཐར་གྱིས་སྙོམས་པར་འཇུག་པ་སྟེ། དེ་ནི་ཞི་གནས་ཞེས་བྱའོ། ། ཡང་ཞི་གནས་ཀྱི་ཚོགས་ཚད་མེད་པ་སྟེ། ཚོགས་དེ་ལ་གང་རྗེས་སུ་རྟོགས་པ་དེ་ནི་ཞི་གནས་ཞེས་བྱའོ། །
en: “What is calm abiding meditation? It is mental peace, calm, and tranquility. It is to not be distracted, to tame the senses. It is to not be wild, to not be haughty, to not be fickle, and to not babble. It is to be gentle, to be careful, and to not be slack. It is to be pleasant. It is to enjoy solitude, to remove oneself from society, and to enjoy isolation. It is to isolate the body, to not let the mind be disturbed, and to turn one’s attention toward the wilderness. It is to have few desires and to be content. It is to maintain a pure livelihood, to be of good character, and to conscientiously maintain one’s practice. It is to know the right time for things, to know the right moment for things, and to know what the right amount is. It is to be easily sated, to be easily satisfied. It is to be analytical and to not be excitable or depressed. It is to be able to endure insulting words. It is to be motivated for spiritual practice, to take joy in the practice of introspection, and to engage one’s mind in the different aspects of meditation. It is to cultivate love, to develop compassion, to dwell in joy, and to practice equanimity. It is to gradually attain the meditative states, from the first through to the eighth. This is what is known as calm abiding meditation.

source: དེ་ལ་ལྷག་མཐོང་གང་ཞེ་ན། གང་ཤེས་རབ་ཀྱི་ཆ་དང་འཐུན་པའི་སྒོམ་པའི་ལམ་སྟེ། ཆོས་རྣམས་ལ་གཡོ་བ་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། ཕུང་པོ་རྣམས་ལ་སྒྱུ་མའི་ཕུང་པོར་མཐོང་བའི་ཤེས་པ་དང་། ཁམས་རྣམས་ལ་ཆོས་ཀྱི་ཁམས་སུ་མཐོང་བའི་ཤེས་པ་དང་། སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་པར་མཐོང་བའི་ཤེས་པ་དང་། མིག་ལ་རབ་ཏུ་རྣམ་པར་ཕྱེ་བར་མཐོང་བའི་ཤེས་པ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མི་འགལ་བར་མཐོང་བའི་ཤེས་པ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་བྲལ་བར་མཐོང་བའི་ཤེས་པ་དང་། རྒྱུ་དང་འབྲས་བུ་རྣམ་པར་སྨིན་པ་མཐོང་བའི་ཤེས་པ་དང་། འབྲས་བུ་ཐོབ་པ་མངོན་སུམ་དུ་བྱ་བ་མཐོང་བའི་ཤེས་པ་དང་། ཡང་དག་པ་ཉིད་དུ་འཇུག་པ་ལ་འཇུག་པར་བྱེད་པ་མཐོང་བའི་ཤེས་པའོ། །
en: “What is insight meditation? It is the path of practice, which is related to wisdom. It is the fact that there is no movement in phenomena, no self, no life force, and no person. It is the knowledge that sees the skandhas as heaps of illusions, the knowledge that sees the phenomenal element in the elements, and the knowledge that sees the sense fields as an empty city. It is the knowledge that sees distinctions with respect to the eye, the knowledge that sees no contradiction with respect to dependent origination, and the knowledge that sees without holding the view of a being. It is the knowledge that sees the process of ripening from cause to effect, the knowledge that sees immediately what the effect will be, and the knowledge that sees the process by which one can access perfection.

source: ཡང་ལྷག་མཐོང་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། ཆོས་རྣམས་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དང་། ཆོས་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་མཐོང་བ་དང་། ཆོས་རྣམས་ཀྱི་གཞན་མ་ཡིན་པ་ཉིད་མཐོང་བ་དང་། ཆོས་རྣམས་ཀྱི་སྟོང་པ་ཉིད་མཐོང་བ་དང་། མཚན་མ་མེད་པ་མཐོང་བ་དང་། སྨོན་པ་མེད་པ་མཐོང་བའོ། །
en: “Furthermore, insight meditation refers to seeing phenomena just as they are, seeing the actual nature of phenomena, seeing nothing other than phenomena just as they are, seeing that phenomena are empty, seeing that phenomena are free from attributes, and seeing that phenomena are free from aspiration.

source: ཡང་ལྷག་མཐོང་ཞེས་བྱ་བ་ནི་རྒྱུས་མཐོང་བ་མེད་པ་དང་རྒྱུ་མེད་པར་མཐོང་བ་མེད་པ་དང་། སྐྱེ་བ་དང་། འཇིག་པ་དང་། གནས་པའི་རྒྱུས་མཐོང་བ་མེད་པ་དང་། དམིགས་པའི་རྒྱུས་མཐོང་བ་མེད་ཅིང་ལྷག་པར་མཐོང་ཡང་ཅུང་ཟད་ལྷག་པར་མི་མཐོང་བའོ། །
en: “Also, when speaking of ‘insight meditation’ there is no insight that arises due to a cause, no insight without a cause, no insight that is caused by arising, cessation, or remaining, and no insight that is caused by an object. There is in fact no insight at all in insight meditation.

source: གཞན་ཡང་ལྷག་མཐོང་ནི་མཐོང་བས་ཀྱང་མཐོང་ལ་ལྟ་བ་ཡང་མི་མཐོང་བ་སྟེ། གང་གི་ཚེ་དེ་ལྟར་མཐོང་བ་དེའི་ཚེ་ཡང་དག་པར་མཐོང་བའོ། ། ཡང་དག་པར་མཐོང་ན་ལྷག་མཐོང་ལ་མཁས་པ་ཡང་རྗེས་སུ་འཐོབ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མཐོང་དེ་ལྟར་མཐོང་ལ་མངོན་པར་འདུ་བྱེད་པར་ཡང་མི་ལྟུང་ཞིང་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་ལ་ཡང་མི་གནས་ཏེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་མཐོང་ངོ་། །
en: “Moreover, when it comes to insight meditation, one sees due to seeing, but the seeing is not seen. When one sees this, one sees what is real. When one sees what is real, one has mastered insight meditation. While the bodhisatva who practices insight meditation sees in this way, he still does not go over to the side of the unconditioned or stop engaging with the conditions of the roots of virtue. This is what is known as the insight meditation of the bodhisatva.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ཞི་གནས་དང་། ལྷག་མཐོང་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “In this way, the bodhisatva who is skilled in the paths of calm abiding and insight meditation practices the perfection of wisdom.

source: གཞན་ཡང་ལམ་ལ་མཁས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་རྣམ་པ་བཞི་སྟེ། རྣམ་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། ཕྱིར་ཞིང་འབྱུང་བ་དང་། ཉམས་པར་མི་འགྱུར་བ་དང་། ཆུད་མི་ཟ་བར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པའོ། །
en: “Furthermore, in the context of skill in the path, the path of the bodhisatva has four aspects. What are the four aspects of the path of the bodhisatva? They are to cultivate the desire that evil, unwholesome tendencies that have not yet arisen will not arise, and to strive, to be vigorous, to commit oneself, and to apply oneself wholeheartedly to this endeavor; to cultivate the desire to be rid of evil unwholesome tendencies that have arisen, and to strive, to be vigorous, to commit oneself, and to apply oneself wholeheartedly to this endeavor; to cultivate the desire that wholesome tendencies that have not yet arisen will arise, and to strive, to be vigorous, to commit oneself, and to apply oneself wholeheartedly to this endeavor; and to cultivate the desire that wholesome tendencies that have arisen may last, that they may be developed, that they may not degenerate, and that they may not go to waste, and to strive, to be vigorous, to commit oneself, and to apply oneself wholeheartedly to this endeavor.

source: གང་སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅེས་བྱ་བ་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་ཚིག་བླ་དགས་སོ། ། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ་ཞེས་བྱ་བ་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དེ་མི་གཏོང་བའོ། ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་ཅེས་བྱ་བ་ནི་ཚུལ་བཞིན་ལ་སོ་སོར་རྟོག་པའི་ཚིག་བླ་དགས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚུལ་བཞིན་ལ་རབ་ཏུ་སྦྱོར་བ་ནི་མི་དགེ་བའི་ཆོས་རྣམས་མི་འབྱུང་བའི་ཕྱིར་རོ། ། དེ་ལ་མི་དགེ་བའི་ཆོས་རྣམས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་མི་འཐུན་པའི་ཕྱོགས་དང་། ཏིང་ངེ་འཛིན་གྱི་མི་འཐུན་པའི་ཕྱོགས་དང་། ཤེས་རབ་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་སོ། ། དེ་ལ་ཚུལ་ཁྲིམས་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཉམས་པ་དང་། གང་གཞན་ལ་ལ་ཚུལ་ཁྲིམས་ཉམས་པར་འགྱུར་བའི་ཆོས་རྣམས་ཏེ། དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་ཞེས་བྱའོ། ། དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་མི་འཐུན་པའི་ཕྱོགས་གང་ཞེ་ན། གང་ཆོ་ག་ཉམས་པ་དང་། གང་གཞན་ལ་ལ་སེམས་གཡེང་བར་བྱེད་པའི་ཆོས་ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོའི་མི་འཐུན་པའི་ཕྱོགས་དེ་ ནི་ཏིང་ངེ་འཛིན་གྱི་མི་འཐུན་པའི་ཕྱོགས་ཞེས་བྱའོ། །
en: “When one says that he ‘cultivates the desire that evil, unwholesome tendencies will not arise,’ this is an expression of his proper mental application. When one says that he will ‘strive and be vigorous,’ this is an expression of the fact that he will not abandon this proper mental application. When one says that he will ‘commit himself and apply himself wholeheartedly to this endeavor,’ this is an expression of the fact that he will investigate this in a non-superficial way. Why is this? When one applies oneself in a non-superficial way, unwholesome tendencies will not be supported. What are these unwholesome tendencies? They are that which is detrimental to morality, that which is detrimental to concentration, and that which is detrimental to wisdom. What is it that is detrimental to morality? It is failing to maintain one’s morality, as well as when there are any external factors that cause one to fail in one’s morality. This is what is known as being detrimental to morality. What is it that is detrimental to concentration? It is when one’s character is not good, as well as when there are any external factors that are detrimental to the concentration one has amassed and that create distractions in the mind. This is what is known as being detrimental to concentration.

source: དེ་ལ་ཤེས་རབ་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྟ་བ་ཉམས་པ་དང་། གང་གཞན་ལ་ལ་ལྟ་བ་ཀུན་ནས་ལྡང་བའི་སྒྲིབ་པར་བྱེད་པའི་ཆོས་གང་ཤེས་རབ་ཀྱི་ཕུང་པོའི་མི་འཐུན་པའི་ཕྱོགས་དེ་ ནི་ཤེས་རབ་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་ཞེས་བྱ་སྟེ དེ་ནི་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱའོ། ། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་གང་གིས་སྡིག་པ་མི་དགེ་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་སྟེ། དེ་བས་ན་མི་དགེ་བའི་ཆོས་དེ་དག་སེམས་ལ་ཕུང་པོར་གྱུར་པ་མ་ཡིན། ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་སོ། ། གང་ཡང་མི་དགེ་བའི་ཆོས་དེ་རྣམས་སེམས་ལ་རྒྱུ་བའི་སྡུག་པའི་རྣམ་པས་འདོད་ཆགས་སམ། ཁོང་ཁྲོ་བའི་རྣམ་པས་ཞེ་སྡང་ངམ། མ་རིག་པའི་རྣམ་པས་གཏི་མུག་གམ། རྒྱུ་དང་སྒྲིབ་པ་གང་དག་ལས་བྱུང་བ་ཤེས་ཤིང་དེ་ལ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་རྣམ་པ་མི་གཙང་བས་འདོད་ཆགས་ཞི་བར་བྱེད། བྱམས་པས་ཞེ་སྡང་ཞི་བར་བྱེད། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་གཏི་མུག་ཞི་བར་བྱེད་དེ། གང་ཀུན་ནས་ཉོན་མོངས་པ་དེ་དག་ཞི་བ་དེ་ནི་ཐ་སྙད་དུ་བཏགས་པའི་ཕྱིར་སྤོང་བ་ཞེས་བྱའོ། ། གང་སྤོང་བ་དེ་ནི་གང་ཡང་རྙེད་པར་མི་འགྱུར་རོ། ། མཉམ་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མངོན་སུམ་པས་ན་དེའི་ཕྱིར་ཡང་དག་པར་སྤོང་བ་ཞེས་བྱ་སྟེ། དེ་ནི་ཡང་དག་པར་སྤོང་བ་གཉིས་པའོ། །
en: What is it that is detrimental to wisdom? It is when one fails to maintain right view, as well as when there are any external factors that are detrimental to the wisdom one has amassed and that create obstructions that overwhelm one’s right view. This is what is known as being detrimental to wisdom. These things are what are known as evil unwholesome tendencies. With proper mental application, he cultivates the desire to eliminate these kinds of evil unwholesome tendencies and to strive, to be vigorous, to commit himself, and to apply himself wholeheartedly to this endeavor. Then these unwholesome tendencies will not amass in his mind—they will find no room; they will have no place there. “He understands the mental processes that are involved in these unwholesome tendencies. He understands that they have arisen on the basis of causes and objects, desire being caused by beauty, anger being caused by enmity, and confusion being caused by ignorance. Because he understands this, he applies his mind in an appropriate way, and he uses what is disagreeable to pacify desire, love to pacify anger, and dependent origination to pacify confusion. This way of pacifying the corruptions is known as elimination through labeling designations. Nothing is attained with this kind of elimination. When the sameness of all phenomena manifests itself directly, that is what is known as proper elimination. This is the second kind of perfect elimination.

source: གང་ཡང་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་ཞེས་བྱ་བ་དེ་ནི་གནས་ཚད་མེད་པ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡང་དག་པར་བསྒྲུབ་པར་བྱ་བའི་དགེ་བའི་ཆོས་ཚད་མེད་པའི་ཕྱིར་རོ། ། དེ་ལ་འདུན་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་རྩ་བའོ། ། བརྩོན་འགྲུས་ཡང་དག་པར་སྒྲུབ་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་རྩ་བའོ། ། སེམས་རབ་ཏུ་འཛིན་པ་ཉམས་སུ་ལོན་པར་བྱེད་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ནི་ཡང་དག་པར་སྤོང་བ་གསུམ་པའོ། །
en: “Then, when he says that he will ‘cultivate the desire that wholesome tendencies that have not yet arisen will arise,’ and that he will ‘strive, be vigorous, commit himself, and apply himself wholeheartedly to this endeavor,’ these are words that cannot be measured. Why is this? It is because the wholesome tendencies that are to be cultivated by the bodhisatva are immeasurable. This desire is the root of all roots of virtue. To command vigor is the root of all roots of virtue. Mental engagement and application are the roots of all roots of virtue. This is the third kind of perfect elimination.

source: གང་ཡང་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། ཉམས་པར་མི་འགྱུར་བ་དང་། ཆུད་མི་ཟ་བར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད། འབད་པར་བྱེད། བརྩོན་འགྲུས་རྩོམ། སེམས་རབ་ཏུ་འཛིན། ཡང་དག་པར་རབ་ཏུ་འཇོག་ཅེས་བྱ་བ་དེ་ནི་དགེ་བའི་རྩ་བ་བྱང་ཆུབ་ཏུ་བསྔོས་པའི་ཚིག་བླ་དགས་སོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་བའི་རྩ་བ་བྱང་ཆུབ་ཏུ་བསྔོས་པ་ནི་མཐར་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དུ་སླར་ཆུད་ཟ་བར་མི་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་ཁམས་གསུམ་ལ་མི་གནས་པར་སེམས་བསྐྱེད་པའི་ཕྱིར་རོ། ། གང་ཁམས་གསུམ་ལ་གནས་པའི་དགེ་བའི་རྩ་བ་དེ་ནི་ཟད་པར་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་སེམས་བསྐྱེད་པ་དེ་ནི་ཁམས་གསུམ་ལ་གནས་པའི་ཕྱིར་རོ། ། གང་ཡང་དགེ་བའི་རྩ་བ་ཁམས་གསུམ་ལ་མི་གནས་པ་ཐམས་ཅད་མཁྱེན་པར་བསྔོས་པ་དེ་ལ་ཟད་པ་གང་ཡང་མེད་དེ། དེ་ནི་ཡང་དག་པར་སྤོང་བ་བཞི་པའོ། །
en: “Then, when he says that he will ‘cultivate the desire that wholesome tendencies that have arisen may last, that they may be developed, that they may not degenerate, and that they may not go to waste,’ and that he will ‘strive, be vigorous, commit himself, and apply himself wholeheartedly to this endeavor,’ this is an expression of the fact that he dedicates his roots of virtue to awakening. Why is this? It is because roots of virtue that are dedicated to awakening will not be lost until one finally reaches the seat of awakening. Why is this? It is because his motivation is not dependent on the three realms. Any roots of virtue that are related to the three realms will perish. Why is this? It is because his motivation is dependent on the three realms. In this way, roots of virtue that are not dependent on the three realms and that are dedicated to the state of omniscience will not perish for any reason. This is the fourth kind of perfect elimination.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ཡན་ལག་བཞི་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This is how the bodhisatva who is skilled in the four elements of the path practices the perfection of wisdom.

source: གཞན་ཡང་ལམ་ལ་མཁས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡན་ལག་ལྔ་པ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ།
en: “Furthermore, in the context of skill in the path, the path of the bodhisatva has five elements. What are these five elements? They are the faculty of faith, the faculty of vigor, the faculty of mindfulness, the faculty of concentration, and the faculty of wisdom.

source: དེ་ལ་དད་པའི་དབང་པོ་གང་ཞེ་ན། དད་པ་གང་གིས་ཆོས་བཞི་ལ་དད་པར་བྱེད་པ་སྟེ། བཞི་གང་ཞེ་ན། འཁོར་བ་ན་སྤྱོད་པའི་འཇིག་རྟེན་པའི་ཡང་དག་པར་ལྟ་བ་ལ་མངོན་པར་དད་དེ། དེ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་ཡིན། དེ་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡང་དད་དེ། སྤྱོད་པ་ལ་ཞུགས་པ་དེ་ཐེག་པ་གཞན་ལ་འདོད་པར་མི་བྱེད་པ་དང་། དོན་དམ་པ་ངེས་པའི་དོན་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་མོ་དང་། སེམས་ཅན་ལ་རྣམ་པར་དཔྱོད་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པའི་མཚན་ཉིད་ཀྱི་ཆོས་ཐམས་ཅད་ལ་དད་དེ ལྟ་བར་བྱ་བ་ཐམས་ཅད་བག་ལ་ཉལ་བར་མི་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། སྟོབས་དང་། མི་འཇིགས་པ་རྣམས་ལ་དད་ཅིང་ཐོས་ནས་ཐེ་ཚོམ་མེད་པ། ནེམ་ནུར་མེད་པར་ཆོས་དེ་རྣམས་སྡུད་པར་བྱེད་པ་དེ་ནི་དད་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: “What is the faculty of faith? It is the faith that trusts in four Dharma teachings. What are these four Dharma teachings? They are to trust completely in the right view of worldly matters and the workings of cyclic existence; to rely on the ripening of the fruits of actions and not engage in any evil actions, even to save one’s life; to have faith in the way of the bodhisatva and not long for any other approach when one is engaging with the practice; to have faith in the explicit meaning of the ultimate truth, the profundity of dependent origination, the fact that all phenomena are characterized by emptiness and freedom from attributes but still not harbor any tendency to cling to views; and to have faith in all the qualities of the Buddha, his powers and confidences, and to not question them or doubt them when one hears about them but rather work to develop these qualities. This is what is known as the faculty of faith.

source: དེ་ལ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་གང་ཞེ་ན། ཆོས་གང་ལ་དད་པ་དེ་བརྩོན་འགྲུས་ཀྱི་དབང་པོས་སྐྱེད་པར་བྱེད་པ་སྟེ། དེ་ནི་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཞེས་བྱའོ། །
en: “What is the faculty of vigor? When one has faith in these qualities one works vigorously to attain them. This is what is known as the faculty of vigor.

source: ཆོས་གང་དག་བརྩོན་འགྲུས་ཀྱིས་སྡུད་པ་དེ་དག་དྲན་པའི་དབང་པོས་ཆུད་མི་ཟ་བར་བྱེད་པ་དེ་ནི་དྲན་པའི་དབང་པོ་ཞེས་བྱའོ། །
en: “Because of one’s faculty of mindfulness, one does not forget about these qualities when one is working vigorously to attain them. This is what is known as the faculty of mindfulness.

source: ཆོས་གང་དག་དྲན་པའི་དབང་པོས་ཆུད་མི་ཟ་བར་བྱེད་པའི་ཆོས་དེ་དག་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་ཏུ་བྱེད་པ་དེ་ནི་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཞེས་བྱའོ། །
en: “One does not forget about these qualities because of one’s faculty of mindfulness, and one remains focused on them one-pointedly by means of one’s faculty of concentration. This is what is known as the faculty of concentration.

source: ཆོས་གང་དག་ཏིང་ངེ་འཛིན་གྱི་དབང་པོས་རྩེ་གཅིག་པར་བྱེད་པ་དེ་དག་ཤེས་རབ་ཀྱི་དབང་པོས་སོ་སོར་རྟོག་པར་བྱེད་དེ། གང་ཆོས་དེ་དག་ཤེས་པར་བྱེད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་ཞེས་བྱའོ། །
en: “One remains focused on these qualities one-pointedly by means of one’s faculty of concentration. One analyzes them by means of one’s faculty of wisdom and comes to understand them. This is what is known as the faculty of wisdom.
